"""
Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24
Затем вывести информацию о сети и маске в таком формате:



Network:
10 1 1 0
00001010 00000001 00000001 00000000

Mask:
/24
255 255 255 0
11111111 11111111 11111111 00000000

Проверить работу скрипта на разных комбинациях сеть/маска.
Ограничение: Все задания надо выполнять используя только пройденные темы.
"""
#Решение:
network = input("Enter your network:\n")
network = network.split("/")

octets = network[0]
mask = network[1]

octet1, octet2, octet3, octet4 = octets.split(".")
octet1 = int(octet1)
octet2 = int(octet2)
octet3 = int(octet3)
octet4 = int(octet4)

ip_template = """
Network:
{0:<} {1:<} {2:<} {3:<}
{0:08b} {1:08b} {2:08b} {3:08b}
""".format(octet1, octet2, octet3, octet4)
print(ip_template)


dictsubnet = {"0":"0.0.0.0", "1":"128.0.0.0", "2":"192.0.0.0", "3":"224.0.0.0", "4":"240.0.0.0", "5":"248.0.0.0", "6":"252.0.0.0", "7":"254.0.0.0", "8":"255.0.0.0", "9":"255.128.0.0", "10":"255.192.0.0", "11":"255.224.0.0", "12":"255.240.0.0", "13":"255.248.0.0", "14":"255.252.0.0", "15":"255.254.0.0", "16":"255.255.0.0", "17":"255.255.128.0", "18":"255.255.192.0", "19":"255.255.224.0", "20":"255.255.240.0", "21":"255.255.248.0", "22":"255.255.252.0", "23":"255.255.254.0", "24":"255.255.255.0", "25":"255.255.255.128", "26":"255.255.255.192", "27":"255.255.255.224", "28":"255.255.255.240", "29":"255.255.255.248", "30":"255.255.255.252", "31":"255.255.255.254", "32":"255.255.255.255"}
subnet = dictsubnet[mask]

octet1, octet2, octet3, octet4 = subnet.split(".")
octet1 = int(octet1)
octet2 = int(octet2)
octet3 = int(octet3)
octet4 = int(octet4)

mask = "/" + mask
mask_template = """
Mask:
{0}
{1:<} {2:<} {3:<} {4:<}
{1:08b} {2:08b} {3:08b} {4:08b}
""".format(mask, octet1, octet2, octet3, octet4)
print(mask_template)

